marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Fls_TS_T40D2M10I1R0/include/Reg_eSys_QSPI.h
/**
*   @file    Reg_eSys_FLASHC.h
*   @version 1.0.1
*
*   @brief   AUTOSAR Fls - Defines used to access the Flash registers.
*   @details This file contains defines used to access the Flash registers.
*
*   @addtogroup FLS
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.2 MCAL
*   Platform             : ARM
*   Peripheral           : IPV_FTFE
*   Dependencies         : 
*
*   Autosar Version      : 4.2.2
*   Autosar Revision     : ASR_REL_4_2_REV_0002
*   Autosar Conf.Variant :
*   SW Version           : 1.0.1
*   Build Version        : S32K14x_MCAL_1_0_1_RTM_ASR_REL_4_2_REV_0002_20180713
*
*   (c) Copyright 2006-2016 Freescale Semiconductor, Inc. 
*       Copyright 2017-2018 NXP
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/

#ifndef REG_ESYS_QSPI_H
#define REG_ESYS_QSPI_H

#ifdef __cplusplus
extern "C"{
#endif

/**
* @page misra_violations MISRA-C:2004 violations
*
* @section Reg_eSys_FLASHC_H_REF_1
* Violates MISRA 2004 Required Rule 19.15, Repeated include files, Precautions shall be taken in
* order to prevent the contents of a header file being included twice This is not a violation since
* all header files are protected against multiple inclusions
*
* @section Reg_eSys_FLASHC_H_REF_2
* Violates MISRA 2004 Required Rule 5.1, Identifier exceeds 31 characters
*
* @section [global]
* Violates MISRA 2004 Required Rule 20.2, The names of standard library macros, objects and functions
* shall not be reused. The driver needs to use defines starting with letter E.
*
*/

/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/

/**
* @violates @ref Reg_eSys_FLASHC_H_REF_1 MISRA 2004 Required Rule 19.15, Repeated include file
*/
#include "Reg_eSys.h"

/*==================================================================================================
*                              SOURCE FILE VERSION INFORMATION
==================================================================================================*/

#define ESYS_QSPI_VENDOR_ID                           43
#define ESYS_QSPI_AR_RELEASE_MAJOR_VERSION            4
#define ESYS_QSPI_AR_RELEASE_MINOR_VERSION            2
#define ESYS_QSPI_AR_RELEASE_REVISION_VERSION         2
#define ESYS_QSPI_SW_MAJOR_VERSION                    1
#define ESYS_QSPI_SW_MINOR_VERSION                    0
#define ESYS_QSPI_SW_PATCH_VERSION                    1

#ifndef DISABLE_MCAL_INTERMODULE_ASR_CHECK
    #if ((ESYS_QSPI_AR_RELEASE_MAJOR_VERSION != REG_ESYS_AR_RELEASE_MAJOR_VERSION) || \
         (ESYS_QSPI_AR_RELEASE_MINOR_VERSION != REG_ESYS_AR_RELEASE_MINOR_VERSION) \
        )
        #error "AutoSar Version Numbers of Reg_eSys_QSPI.h and Reg_eSys.h are different"
    #endif
#endif
/*==================================================================================================
*                                          CONSTANTS
==================================================================================================*/
/* QSPI registers byte offsets */
#define QSPI_MCR_OFFSET_U32                 ((uint32)0x000UL)
#define QSPI_IPCR_OFFSET_U32                ((uint32)0x008UL)
#define QSPI_FLSHCR_OFFSET_U32              ((uint32)0x00CUL)
#define QSPI_BUFXCR_OFFSET_U32              ((uint32)0x010UL)
#define QSPI_BUF0CR_OFFSET_U32              ((uint32)0x010UL)
#define QSPI_BUF1CR_OFFSET_U32              ((uint32)0x014UL)
#define QSPI_BUF2CR_OFFSET_U32              ((uint32)0x018UL)
#define QSPI_BUF3CR_OFFSET_U32              ((uint32)0x01CUL)
#define QSPI_BFGENCR_OFFSET_U32             ((uint32)0x020UL)
#define QSPI_SOCCR_OFFSET_U32               ((uint32)0x024UL)
#define QSPI_BUFXIND_OFFSET_U32             ((uint32)0x030UL)
#define QSPI_BUF0IND_OFFSET_U32             ((uint32)0x030UL)
#define QSPI_BUF1IND_OFFSET_U32             ((uint32)0x034UL)
#define QSPI_BUF2IND_OFFSET_U32             ((uint32)0x038UL)
#define QSPI_SFAR_OFFSET_U32                ((uint32)0x100UL)
#define QSPI_SFACR_OFFSET_U32               ((uint32)0x104UL)
#define QSPI_SMPR_OFFSET_U32                ((uint32)0x108UL)
#define QSPI_RBSR_OFFSET_U32                ((uint32)0x10CUL)
#define QSPI_RBCT_OFFSET_U32                ((uint32)0x110UL)
#define QSPI_TBSR_OFFSET_U32                ((uint32)0x150UL)
#define QSPI_TBDR_OFFSET_U32                ((uint32)0x154UL)
#define QSPI_TBCT_OFFSET_U32                ((uint32)0x158UL)
#define QSPI_SR_OFFSET_U32                  ((uint32)0x15CUL)
#define QSPI_FR_OFFSET_U32                  ((uint32)0x160UL)
#define QSPI_RSER_OFFSET_U32                ((uint32)0x164UL)
#define QSPI_SPNDST_OFFSET_U32              ((uint32)0x168UL)
#define QSPI_SPTRCLR_OFFSET_U32             ((uint32)0x16CUL)
#define QSPI_SFA1AD_OFFSET_U32              ((uint32)0x180UL)
#define QSPI_SFA2AD_OFFSET_U32              ((uint32)0x184UL)
#define QSPI_SFB1AD_OFFSET_U32              ((uint32)0x188UL)
#define QSPI_SFB2AD_OFFSET_U32              ((uint32)0x18CUL)
#define QSPI_DLPR_OFFSET_U32                ((uint32)0x190UL)
#define QSPI_RBDR_OFFSET_U32                ((uint32)0x200UL)
#define QSPI_LUTKEY_OFFSET_U32              ((uint32)0x300UL)
#define QSPI_LCKCR_OFFSET_U32               ((uint32)0x304UL)
#define QSPI_LUT_OFFSET_U32                 ((uint32)0x310UL)

