marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Fls_TS_T40D2M10I1R0/include/Reg_eSys_QSPI.h
/* RX BUFFER - AHB interface base address through ARDBx registers. */
/* Kinetis integration specific. */
#define QSPI_0_ARDB_BASEADDR_U32            ((uint32)0x67000000UL)

/* QSPI registers word offsets */
#define QSPI_MCR_WORD_OFFSET_U32            ((uint32)0x000UL)
#define QSPI_IPCR_WORD_OFFSET_U32           ((uint32)0x002UL)
#define QSPI_FLSHCR_WORD_OFFSET_U32         ((uint32)0x003UL)
#define QSPI_BUFXCR_WORD_OFFSET_U32         ((uint32)0x004UL)
#define QSPI_BUF0CR_WORD_OFFSET_U32         ((uint32)0x004UL)
#define QSPI_BUF1CR_WORD_OFFSET_U32         ((uint32)0x005UL)
#define QSPI_BUF2CR_WORD_OFFSET_U32         ((uint32)0x006UL)
#define QSPI_BUF3CR_WORD_OFFSET_U32         ((uint32)0x007UL)
#define QSPI_BFGENCR_WORD_OFFSET_U32        ((uint32)0x008UL)
#define QSPI_SOCCR_WORD_OFFSET_U32          ((uint32)0x009UL)
#define QSPI_BUFXIND_WORD_OFFSET_U32        ((uint32)0x00CUL)
#define QSPI_BUF0IND_WORD_OFFSET_U32        ((uint32)0x00CUL)
#define QSPI_BUF1IND_WORD_OFFSET_U32        ((uint32)0x00DUL)
#define QSPI_BUF2IND_WORD_OFFSET_U32        ((uint32)0x00EUL)
#define QSPI_SFAR_WORD_OFFSET_U32           ((uint32)0x040UL)
#define QSPI_SFACR_WORD_OFFSET_U32          ((uint32)0x041UL)
#define QSPI_SMPR_WORD_OFFSET_U32           ((uint32)0x042UL)
#define QSPI_RBSR_WORD_OFFSET_U32           ((uint32)0x043UL)
#define QSPI_RBCT_WORD_OFFSET_U32           ((uint32)0x044UL)
#define QSPI_TBSR_WORD_OFFSET_U32           ((uint32)0x054UL)
#define QSPI_TBDR_WORD_OFFSET_U32           ((uint32)0x055UL)
#define QSPI_TBCT_WORD_OFFSET_U32           ((uint32)0x056UL)
#define QSPI_SR_WORD_OFFSET_U32             ((uint32)0x057UL)
#define QSPI_FR_WORD_OFFSET_U32             ((uint32)0x058UL)
#define QSPI_RSER_WORD_OFFSET_U32           ((uint32)0x059UL)
#define QSPI_SPNDST_WORD_OFFSET_U32         ((uint32)0x05AUL)
#define QSPI_SPTRCLR_WORD_OFFSET_U32        ((uint32)0x05BUL)
#define QSPI_SFA1AD_WORD_OFFSET_U32         ((uint32)0x060UL)
#define QSPI_SFA2AD_WORD_OFFSET_U32         ((uint32)0x061UL)
#define QSPI_SFB1AD_WORD_OFFSET_U32         ((uint32)0x062UL)
#define QSPI_SFB2AD_WORD_OFFSET_U32         ((uint32)0x063UL)
#define QSPI_DLPR_WORD_OFFSET_U32           ((uint32)0x064UL)
#define QSPI_RBDR_WORD_OFFSET_U32           ((uint32)0x080UL)
#define QSPI_LUTKEY_WORD_OFFSET_U32         ((uint32)0x0C0UL)
#define QSPI_LCKCR_WORD_OFFSET_U32          ((uint32)0x0C1UL)
#define QSPI_LUT_WORD_OFFSET_U32            ((uint32)0x0C4UL)


#define QSPI_MCR_MDIS_U32                       ((uint32)0x00004000UL)  /* MDIS - Module Disable.           QSPI_MCR[14] */
#define QSPI_MCR_DDR_EN_U32                     ((uint32)0x00000080UL)  /* DDR_EN - DDR mode enable.        QSPI_MCR[7] */
#define QSPI_MCR_DQS_EN_U32                     ((uint32)0x00000040UL)  /* DQS_EN - DQS enable.             QSPI_MCR[6] */
#define QSPI_MCR_DQS_LAT_EN_U32                 ((uint32)0x00000020UL)  /* DQS_LAT_EN - DQS Latency enable. QSPI_MCR[5] */
#define QSPI_MCR_COARSE_DLY_SHIFT_U32           (29U)           /* Bit position of Coarse delay position inside QSPI_MCR. */
#define QSPI_MCR_END_MASK_U32                   ((uint32)0x0000000CUL)  /* END_CFG - Endianness. QSPI_MCR[3:2] */
#define QSPI_MCR_END_SHIFT_U32                  (2U)            /* Bit position of Endianness configuration inside QSPI_MCR. */
#define QSPI_MCR_CLR_TXF_U32                    ((uint32)0x00000800UL)  /* Clear TX FIFO. Invalidates the TX Buffer.*/                   
#define QSPI_MCR_CLR_RXF_U32                    ((uint32)0x00000400UL)  /* Clear RX FIFO. Invalidates the RX Buffer.*/                   
#define QSPI_MCR_SWRSTHD_U32                    ((uint32)0x00000002UL)  /* MCR[1] - Software reset for AHB domain. */
#define QSPI_MCR_SWRSTSD_U32                    ((uint32)0x00000001UL)  /* MCR[0] - Software reset for serial flash domain. */


/* Kinetis integration specific. */
#define QSPI_MCR_PADS_BUF_EN_U32                ((uint32)0x80000000UL)  /* SCLKCFG[7] - Enables input buffer of QSPI pads for SDR and HyperRAM modes.    QSPI_MCR[31] */
#define QSPI_MCR_INPUT_CLK_SEL_U32              ((uint32)0x40000000UL)  /* SCLKCFG[6] - Quadspi Clocking mode selection. Always program SCLKCFG[6] twice while configuring mode selection.    QSPI_MCR[30] */
#define QSPI_MCR_HYPERRAM_SEL_U32               ((uint32)0x20000000UL)  /* SCLKCFG[5] - HyperRAM selection for Flash B - Reference clock selection for DQS for Flash-B.    QSPI_MCR[29] */
#define QSPI_MCR_INTERN_REF_CLK_SEL_U32         ((uint32)0x10000000UL)  /* SCLKCFG[4] - Internal reference clock (async clock domain) source selection for Quadspi.    QSPI_MCR[28] */
#define QSPI_MCR_DQS_B_STAGE2_CLK_SRC_U32       ((uint32)0x08000000UL)  /* SCLKCFG[3] - Reference clock selection for DQS for Flash-B.    QSPI_MCR[27] */
#define QSPI_MCR_DQS_B_STAGE1_CLK_SRC_U32       ((uint32)0x04000000UL)  /* SCLKCFG[2] - Reference clock selection for DQS for Flash-B.    QSPI_MCR[26] */
#define QSPI_MCR_DQS_A_STAGE2_CLK_SRC_U32       ((uint32)0x02000000UL)  /* SCLKCFG[1] - Reference clock selection for DQS for Flash-A.    QSPI_MCR[25] */
#define QSPI_MCR_DQS_A_STAGE1_CLK_SRC_U32       ((uint32)0x01000000UL)  /* SCLKCFG[0] - Reference clock selection for DQS for Flash-A.    QSPI_MCR[24] */

#define QSPI_MCR_ISD3FB_U32                     ((uint32)0x00080000UL)  /* Idle Signal Drive IOFB[3] Flash B. */
#define QSPI_MCR_ISD2FB_U32                     ((uint32)0x00040000UL)  /* Idle Signal Drive IOFB[2] Flash B. */
#define QSPI_MCR_ISD3FA_U32                     ((uint32)0x00020000UL)  /* Idle Signal Drive IOFA[3] Flash A. */
#define QSPI_MCR_ISD2FA_U32                     ((uint32)0x00010000UL)  /* Idle Signal Drive IOFA[2] Flash A. */
                    
#define QSPI_SMPR_DDRSMP_MASK_U32               ((uint32)0x00070000UL)  /* SMPR[18:16] - DDR Sampling point. */
#define QSPI_SMPR_DDRSMP_SHIFT_U32              (16U)           /* Bit position of DDRSMP field. */
#define QSPI_SMPR_FSPHS_U32                     ((uint32)0x00000020UL)  /* FSPHS - Full Speed Phase selection for SDR instructions and DQS DDR mode.    QSPI_SMPR[5] */
#define QSPI_SMPR_FSDLY_U32                     ((uint32)0x00000040UL)  /* FSDLY - Full Speed Delay selection for SDR instructions and DQS DDR mode.    QSPI_SMPR[6] */

#define QSPI_FLSHCR_TDH_MASK_U32                ((uint32)0x00030000UL)  /* TDH - Serial flash data in hold time.   QSPI_FLSHCR[17:16] */
#define QSPI_FLSHCR_TDH_SHIFT_U32               (16U)           /* TDH - Serial flash data in hold time.   QSPI_FLSHCR[17:16] */
#define QSPI_FLSHCR_TCSH_MASK_U32               ((uint32)0x00000F00UL)  /* TCSH - Serial flash CS hold time.   QSPI_FLSHCR[11:8] */
#define QSPI_FLSHCR_TCSH_SHIFT_U32              (8U)            /* TCSH - Serial flash CS hold time.   QSPI_FLSHCR[11:8] */
#define QSPI_FLSHCR_TCSS_MASK_U32               ((uint32)0x0000000FUL)  /* TCSS - Serial flash CS setup time.   QSPI_FLSHCR[3:0] */
#define QSPI_FLSHCR_TCSS_SHIFT_U32              (0U)            /* TCSS - Serial flash CS setup time.   QSPI_FLSHCR[3:0] */

#define QSPI_RBCT_RXBRD_MASK_U32                ((uint32)0x100UL)


#define QSPI_SOCCR_FINE_DLY_A_MASK_U32          ((uint32)0x000000FFUL)  /* SOCCFG[7:0] - Fine delay chain configuration for Flash A.   QSPI_SOCCR[7:0] */
#define QSPI_SOCCR_FINE_DLY_B_MASK_U32          ((uint32)0x0000FF00UL)  /* SOCCFG[15:8] - Fine delay chain configuration for Flash B.  QSPI_SOCCR[15:8] */
#define QSPI_SOCCR_FINE_DLY_A_SHIFT_U32         (0U)            /* Bit position of fine delay chain configuration for Flash A. */
#define QSPI_SOCCR_FINE_DLY_B_SHIFT_U32         (8U)            /* Bit position of fine delay chain configuration for Flash B. */
#define QSPI_SOCCR_PENDIG_READ_GASKET_U32       ((uint32)0x00010000UL)  /* SOCCFG[16] - Pending read enable controls the bus gasket’s handling of pending read transactions. */
#define QSPI_SOCCR_BURST_READ_GASKET_U32        ((uint32)0x00020000UL)  /* SOCCFG[17] - Burst read enable controls the bus gasket’s handling of burst read transactions. */
#define QSPI_SOCCR_BURST_WRITE_GASKET_U32       ((uint32)0x00040000UL)  /* SOCCFG[18] - Burst writes enable controls the bus gasket’s handling of burst read transactions. */
#define QSPI_SOCCR_PROGRAM_DIVIDER_MASK_U32     ((uint32)0xE0000000UL)  /* SOCCFG[31:29] - Programmable divider configuration selection. */
#define QSPI_SOCCR_PROGRAM_DIVIDER_SHIFT_U32    (29U)
#define QSPI_SOCCR_DIVIDER_EN_U32               ((uint32)0x10000000UL)  /* SOCCFG[28] - Programmable Divider Enable. */

#define QSPI_BUFxCR_MSTRID_MASK_U32             ((uint32)0x00000000FUL)

#define QSPI_BUFxCR_ADATSZ_MASK_U32             ((uint32)0x0000FF00UL)
#define QSPI_BUFxCR_ADATSZ_SHIFT_U32            ((uint32)8UL)
#define QSPI_BUF3CR_ALLMST_MASK_U32             ((uint32)0x80000000UL)  /* BUF3CR[31] - All master enable */
#define QSPI_BUF0CR_HP_EN_MASK_U32              ((uint32)0x80000000UL)  /* BUF0CR[31] - High Priority Enable*/

