marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Fls_TS_T40D2M10I1R0/include/Reg_eSys_QSPI.h
#define QSPI_LCKCR_MASK_U32                     ((uint32)0x00000003UL)
#define QSPI_LCKCR_LOCKED_U32                   ((uint32)0x00000001UL)
#define QSPI_LCKCR_UNLOCKED_U32                 ((uint32)0x00000002UL)

#define QSPI_LUT_KEY_VALUE_U32                  ((uint32)0x5AF05AF0UL)  /* The key to lock or unlock the LUT. */

#define QSPI_SR_BUSY_U32                        ((uint32)0x00000001UL)  /* Module Busy. BUSY == 1 when module is busy. */
#define QSPI_SR_RXWE_U32                        ((uint32)0x00010000UL)  /* RX Buffer Watermark Exceeded. RXWE == 1 when the number of valid entries in the RX Buffer exceeds the number given in the QSPI_RBCT[WMRK] field. */

#define QSPI_FR_TBFF_U32                        ((uint32)0x08000000UL)  /* FR[27] TX Buffer Fill Flag. */
#define QSPI_FR_TBUF_U32                        ((uint32)0x04000000UL)  /* FR[26] TX Buffer Underrun Flag. */
#define QSPI_FR_ILLINE_U32                      ((uint32)0x00800000UL)  /* FR[23] Illegal Instruction Error Flag */
#define QSPI_FR_RBOF_U32                        ((uint32)0x00020000UL)  /* FR[17] RX Buffer Overflow Flag. */
#define QSPI_FR_RBDF_U32                        ((uint32)0x00010000UL)  /* FR[16] RX Buffer Drain Flag. Writting 1 POPs WMRK+1 entries from the RXBuffer. */
#define QSPI_FR_ABSEF_U32                       ((uint32)0x00008000UL)  /* FR[15] AHB Sequence Error Flag. */
#define QSPI_FR_AITEF_U32                       ((uint32)0x00004000UL)  /* FR[14] AHB Illegal transaction error flag. */
#define QSPI_FR_AIBSEF_U32                      ((uint32)0x00002000UL)  /* FR[13] AHB Illegal Burst Size Error Flag. */
#define QSPI_FR_ABOF_U32                        ((uint32)0x00001000UL)  /* FR[12] AHB Buffer Overflow Flag. */
#define QSPI_FR_IUEF_U32                        ((uint32)0x00000800UL)  /* FR[11] IP Command Usage Error Flag - parallel mode. */
#define QSPI_FR_IPAEF_U32                       ((uint32)0x00000080UL)  /* FR[7] IP Command Trigger during AHB Access Error Flag. */
#define QSPI_FR_IPIEF_U32                       ((uint32)0x00000040UL)  /* FR[6] IP Command Trigger could not be executed Error Flag.*/
#define QSPI_FR_IPGEF_U32                       ((uint32)0x00000010UL)  /* FR[4] IP Command Trigger during AHB Grant Error Flag. */
#define QSPI_FR_TFF_U32                         ((uint32)0x00000001UL)  /* FR[0] IP Command Transaction Finished Flag. */

#define QSPI_RSER_DLPFIE_U32                    ((uint32)0x80000000UL) /* RSER[31] Data Learning Pattern Failure Interrupt enable. */
#define QSPI_RSER_TBFIE_U32                     ((uint32)0x08000000UL) /* RSER[27] TX Buffer Fill Interrupt Enable. */
#define QSPI_RSER_TBUIE_U32                     ((uint32)0x04000000UL) /* RSER[26] TX Buffer Underrun Interrupt Enable. */
#define QSPI_RSER_TBFDE_U32                     ((uint32)0x02000000UL) /* RSER[25] TX Buffer Fill DMA Enable. */
#define QSPI_RSER_ILLINIE_U32                   ((uint32)0x00800000UL) /* RSER[23] Illegal Instruction Error Interrupt Enable. */
#define QSPI_RSER_RBDDE_U32                     ((uint32)0x00200000UL) /* RSER[21] RX Buffer Drain DMA Enable. */
#define QSPI_RSER_RBOIE_U32                     ((uint32)0x00020000UL) /* RSER[17] RX Buffer Overflow Interrupt Enable. */
#define QSPI_RSER_RBDIE_U32                     ((uint32)0x00010000UL) /* RSER[16] RX Buffer Drain Interrupt Enable. */
#define QSPI_RSER_ABSEIE_U32                    ((uint32)0x00008000UL) /* RSER[15] AHB Sequence Error Interrupt Enable. */
#define QSPI_RSER_AITIE_U32                     ((uint32)0x00004000UL) /* RSER[14] AHB Illegal transaction interrupt enable. */
#define QSPI_RSER_AIBSIE_U32                    ((uint32)0x00002000UL) /* RSER[13] AHB Illegal Burst Size Interrupt Enable. */
#define QSPI_RSER_ABOIE_U32                     ((uint32)0x00001000UL) /* RSER[12] AHB Buffer Overflow Interrupt Enable. */
#define QSPI_RSER_IUEIE_U32                     ((uint32)0x00000800UL) /* RSER[11] IP Command Usage Error Interrupt Enable. */
#define QSPI_RSER_IPAEIE_U32                    ((uint32)0x00000080UL) /* RSER[7]  IP Command Trigger during AHB Access Error Interrupt Enable. */
#define QSPI_RSER_IPIEIE_U32                    ((uint32)0x00000040UL) /* RSER[6]  IP Command Trigger during IP Access Error Interrupt Enable. */
#define QSPI_RSER_IPGEIE_U32                    ((uint32)0x00000010UL) /* RSER[4]  IP Command Trigger during AHB Grant Error Interrupt Enable. */
#define QSPI_RSER_TFIE_U32                      ((uint32)0x00000001UL) /* RSER[0]  Transaction Finished Interrupt Enable. */

#define QSPI_RBCT_WMRK_MASK_U32                 ((uint32)0x0000001FUL)  /* RBCT[4:0] - WMRK bitifield mask. */
#define QSPI_RBCT_WMRK_SHIFT_U32                ((uint32)0x00000000UL)  /* RBCT[4:0] - WMRK bitifield position shift. */

#define QSPI_IPCR_SEQID_MASK_U32                ((uint32)0xF000000UL)   /* IPCR[27:24] SEQID field. */
#define QSPI_IPCR_SEQID_SHIFT_U32               (24U)
#define QSPI_IPCR_IDATSZ_MASK_U32               ((uint32)0x000FFFFUL)   /* IPCR[15:0] IDATSZ field. */
#define QSPI_IPCR_IDATSZ_SHIFT_U32              (0U)
#define QSPI_IPCR_PAR_EN_SHIFT_U32              (16U)           /* IPCR[16] PAR_EN bit. */

#define QSPI_LUT_INSTR0_OPER0_OFFSET_U32        ((uint32)0UL)            /* [INSTR0|PAD0|OPRND0] = LUTx[15:0]*/
#define QSPI_LUT_INSTR0_OPER0_MASK_U32          ((uint32)0x0000FFFFUL)
#define QSPI_LUT_INSTR1_OPER1_OFFSET_U32        ((uint32)16UL)           /* [INSTR1|PAD1|OPRND1] = LUTx[31:16]*/
#define QSPI_LUT_INSTR1_OPER1_MASK_U32          ((uint32)0xFFFF0000UL)

#define QSPI_RBSR_RDBFL_MASK_U32                ((uint32)0x00003F00UL)  /* RBSR[13:8] */
#define QSPI_RBSR_RDBFL_SHIFT_U32               (8U)

#define QSPI_SPTRCLR_IPPTRC_MASK_U32            ((uint32)0x00000100UL)  /* SPTRCLR[8] IP Pointer Clear */
#define QSPI_SPTRCLR_BFPTRC_MASK_U32            ((uint32)0x00000001UL)  /* SPTRCLR[0] Buffer Pointer Clear */

#define QSPI_BFGENCR_SEQID_MASK_U32             ((uint32)0x0000F000UL)  /* BFGENCR[15:12] */
#define QSPI_BFGENCR_SEQID_SHIFT_U32            (12U)
#define QSPI_BFGENCR_PAR_EN_SHIFT_U32           (16U)           /* BFGENCR[16] PAR_EN bit. */

#define QSPI_SFACR_WA_U32                       ((uint32)0x00010000UL)  /* SFACR[16] WA bit. */
#define QSPI_SFACR_CAS_MASK_U32                 ((uint32)0x0000000FUL)  /* SFACR[3:0] CAS bit. */
#define QSPI_SFACR_CAS_SHIFT_U32                (0U)


/* Kinetis integration specific. */
#define QSPI_QSPI_0_AMBA_BASE_U32               ((uint32)0x68000000UL)  /* Base address of Serial flash memory address asignement (upon which memory ch, ChipSelect is determined). */
#define QSPI_QSPI_1_AMBA_BASE_U32               ((uint32)0x68000000UL)  /* Base address of Serial flash memory address asignement (upon which memory ch, ChipSelect is determined). */

#define QSPI_RXBUFFER_MAX_SIZE_BYTES_U32        (128U)          /* Maximum size of RX Buffer in bytes, 32 entries x 4bytes each.*/
#define QSPI_RXBUFFER_MAX_SIZE_WORDS_U32        (32U)           /* Maximum size of RX Buffer in words("entries"), 32 entries x 4bytes each.*/

#define QSPI_TXBUFFER_MAX_SIZE_BYTES_U32        (128U)          /* Maximum size of TX Buffer in bytes, 32 entries x 4bytes each.*/
#define QSPI_TXBUFFER_MAX_SIZE_WORDS_U32        (32U)           /* Maximum size of TX Buffer in words("entries"), 32 entries x 4bytes each.*/

