marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Fls_TS_T40D2M10I1R0/include/Reg_eSys_QSPI.h
#define QSPI_TXBUFFER_MIN_SIZE_BYTES_U32        (16U)           /* Minimum size of TX Buffer in bytes, 32 entries x 4bytes each.*/
#define QSPI_TXBUFFER_MIN_SIZE_WORDS_U32        (4U)            /* Minimum size of TX Buffer in words("entries"), 32 entries x 4bytes each.*/

#define QSPI_PARALLEL_MODE_ENABLED              (1U)
#define QSPI_PARALLEL_MODE_DISABLED             (0U)

/********* LUT instruction type ************/
#define FLS_LUT_INSTR_STOP          (0U)
#define FLS_LUT_INSTR_CMD           (1U)
#define FLS_LUT_INSTR_ADDR          (2U)
#define FLS_LUT_INSTR_DUMMY         (3U)
#define FLS_LUT_INSTR_MODE          (4U)
#define FLS_LUT_INSTR_MODE2         (5U)
#define FLS_LUT_INSTR_MODE4         (6U)
#define FLS_LUT_INSTR_READ          (7U)
#define FLS_LUT_INSTR_WRITE         (8U)
#define FLS_LUT_INSTR_JMP_ON_CS     (9U)
#define FLS_LUT_INSTR_ADDR_DDR      (10U)
#define FLS_LUT_INSTR_MODE_DDR      (11U)
#define FLS_LUT_INSTR_MODE2_DDR     (12U)
#define FLS_LUT_INSTR_MODE4_DDR     (13U)
#define FLS_LUT_INSTR_READ_DDR      (14U)
#define FLS_LUT_INSTR_WRITE_DDR     (15U)
#define FLS_LUT_INSTR_DATA_LEARN    (16U)
#define FLS_LUT_INSTR_CMD_DDR       (17U)
#define FLS_LUT_INSTR_CADDR         (18U)
#define FLS_LUT_INSTR_CADDR_DDR     (19U)

#define FLS_LUT_OPER_16BIT_ADDR     (16U)
#define FLS_LUT_OPER_24BIT_ADDR     (24U)
#define FLS_LUT_OPER_32BIT_ADDR     (32U)


#define FLS_LUT_HYPER_WRITE_MEM_WRAP    (0x00U)
#define FLS_LUT_HYPER_WRITE_MEM_LINEAR  (0x20U)
#define FLS_LUT_HYPER_WRITE_REG_WRAP    (0x40U)
#define FLS_LUT_HYPER_WRITE_REG_LINEAR  (0x60U)
#define FLS_LUT_HYPER_READ_MEM_WRAP     (0x80U)
#define FLS_LUT_HYPER_READ_MEM_LINEAR   (0xA0U)
#define FLS_LUT_HYPER_READ_REG_WRAP     (0xC0U)
#define FLS_LUT_HYPER_READ_REG_LINEAR   (0xE0U)
#define FLS_LUT_HYPER_NOP               (0x00U)

#define FLS_LUT_SEQ_ID_0_U      (0U)
#define FLS_LUT_SEQ_ID_1_U      (1U)
#define FLS_LUT_SEQ_ID_2_U      (2U)
#define FLS_LUT_SEQ_ID_3_U      (3U)
#define FLS_LUT_SEQ_ID_4_U      (4U)
#define FLS_LUT_SEQ_ID_5_U      (5U)
#define FLS_LUT_SEQ_ID_6_U      (6U)
#define FLS_LUT_SEQ_ID_7_U      (7U)
#define FLS_LUT_SEQ_ID_8_U      (8U)
#define FLS_LUT_SEQ_ID_9_U      (9U)
#define FLS_LUT_SEQ_ID_10_U     (10U)
#define FLS_LUT_SEQ_ID_11_U     (11U)
#define FLS_LUT_SEQ_ID_12_U     (12U)
#define FLS_LUT_SEQ_ID_13_U     (13U)
#define FLS_LUT_SEQ_ID_14_U     (14U)
#define FLS_LUT_SEQ_ID_15_U     (15U)       /* The last LUT, reserved for Hyperflash volatile commands loading. */

#define FLS_NO_OF_LUTS_U8       (64U)

#define FLS_HYPERF_TYPE_1_ADDR_U32        ((uint32)0xAAAUL)   /* Byte address 0xAAA will be sent to Hyperflash memory as 0x555, when WA bit is set. */
#define FLS_HYPERF_TYPE_2_ADDR_U32        ((uint32)0x554UL)   /* Byte address 0x554 will be sent to Hyperflash memory as 0x2AA, when WA bit is set. */
#define FLS_HYPERF_TYPE_3_ADDR_U32        ((uint32)0xAAUL)    /* Byte address 0xAA will be sent to Hyperflash memory as 0x55, when WA bit is set. */
#define FLS_HYPERF_TYPE_4_ADDR_U32        ((uint32)0x0UL)     /* Byte address 0x0 will be sent to Hyperflash memory as 0x0, when WA bit is set. */



#define FLS_HYPERF_STATUS_REG_READ_ID_U8    (0x70U)
#define FLS_HYPERF_SECTOR_ERASE_ID_U8       (0x30U)
#define FLS_HYPERF_WRITE_BUFFER_ID_U8       (0x25U)

#define FLS_HYPERF_LINE_SIZE_U32    ((uint32)512UL) /* Each hypeflash line is 512 bytes long. */

#ifdef __cplusplus
}
#endif

#endif /*REG_ESYS_QSPI_H*/

/** @} */
